# -*- coding: utf-8 -*-

def resolve_line_ending(text):
    # Определяем стиль строк: CRLF (\r\n), LF (\n), или CR (\r).
    # В Notepad++ используется именно CRLF и применение функции strip к строкам такого стиля закономерно
    # стрипает символ возврата каретки \r (как это и предполагается работой метода strip, удаляющего следующие символы:
    # [ \t\n\r\f\v]). Чтобы сохранить CRLF в конце Notepad++ строк, разбиваем текст по разделителю на отдельные
    # Python-строки, обрабатываем их, и затем склеиваем обратно по тому же самому разделителю.
    if '\r\n' in text:
        line_ending = '\r\n'
    elif '\r' in text:
        line_ending = '\r'
    else:
        line_ending = '\n'

    return line_ending