# Строка нужна для предотвращения ошибки SyntaxError: Non-UTF-8 code starting with '\xd0'
# -*- coding: utf-8 -*-
import re

from LowerServices import GrcConstants

# https://stackoverflow.com/questions/56363597/regex-for-accepting-greek-characters-with-tone-char
any_greek_letter_regex = r'[\u0370-\u03ff\u1f00-\u1fff]'
greek_word = r'{0}+'.format(any_greek_letter_regex)


# closing_parenthesis_or_dot_group = r'(\)|[.])'

def make_up_main_regex():
    # группа: греческое слово с возможным последующим пробелом
    # данная группа может повторяться один и более раза
    # нужна для захвата греческих фраз
    # προσεκύνησεν έπι το άκρον τής ράβδου αύτοϋ |он поклонился, опершись на жезл (Евр 11.21)
    a = r'({0}\s*)+'.format(greek_word)

    # группа: запятая с пробелом, за которыми идёт греческое слово (последние буквы слова, его окончание)
    # данная группа может повторяться один и более раза
    # нужна для захвата слов, для которых указано одно или несколько окончаний в статьях следующего вида:
    # άληθής, ές
    # άκρογωνιαΐος, α, ον
    b = r'(,\s{0})+'.format(greek_word)

    # группа: содержимое круглых скобок (включая сами скобки) обязательно содержащее греч. буквы (а не только русские)
    # данной группе нет смысла повторяться: она, если и встречается в словарной статье, то только один раз
    # нужна для захвата глагольных форм в статьях следующего вида:
    # άναλαμβάνω (аор. άνέλαβον, аор.пасс. άνελήμφθην)
    # άλίζω (буд.пасс. άλισθήσομαι)| солить; возвращать вкус соли
    # НО
    # Άκύλας |(вин.п.) м.р. Акила, Аквила <- содержимое круглых скобок, не содержащее греч. буков, не захватывается
    # данным фрагментом регулярки
    c = r'(\(.*?{0}.*?\))'.format(greek_word)

    b_space_c = r'({0}\s{1})'.format(b,
                                     c)  # βλητέος, α, ον (отглагольное прил. к βάλλω)| то, что должно быть положено или налито
    b_or_c = r'({0}|{1})'.format(b, c)
    regex = f'{a}({b_space_c}|{b_or_c})?'.format(a, b_space_c, b_or_c)

    return regex


def run(input_text):
    find_and_replace_dict = {

        # подстраховка, которая гарантирует, что текст не содержит двух и более пробелов, идущих подряд
        r'\s\s+': ' ',

        # подстраховка, которая гарантирует, что перед запятой нет пробела
        r'\s,': ',',

        # positive lookbehind + hyphen + positive ahead
        # удалить дефис между только греческими буквами (но не русскими)
        r'(?<={0})[-](?={0})'.format(any_greek_letter_regex): '',
        ']': ';',

        r'αορ[.]': 'аор.',

        make_up_main_regex(): GrcConstants.NEWLINE + r'\g<0>' + GrcConstants.PIPE,

        # данный пукнт делает так, чтобы греческое слово попадало в правый столбец словаря (в столбец к переводу слова)
        # если такое греческое слово встречается в конструкции вида: аор.пасс. к άνάπτω
        r'([.]\sк\s)\n({0})'.format(greek_word): r'\g<1>\g<2>\n',

        # заменить 2 и более символа новой строки одним таким символом
        r'\n\n+': GrcConstants.NEWLINE,

        # positive lookahead: искать \n, стоящий не перед греческой буквой или пробелом, чтобы заменить его на пробел!
        # этот пункт гарантирует, что перевод слова не содержит символа переноса строки и в этом случае конвертация
        # сплошного текста в табличную форму пройдёт более гладко
        r'\n(?!{0}|\s)'.format(any_greek_letter_regex): ' ',

        # remove any leading and trailing newlines and whitespaces
        r'^[\n\s]+|[\n\s]+$': '',

        # old code backup
        # r'\s(?=[2-9]\))': '^^^'

        # искать пробел, слева от которого стоит символ точка с запятой, а справа – число от 2 до 9,
        # за которым следует закрывающая круглая скобка или точка. Заменить такой пробел на ^^^.
        # Затем в OO Writer последовательность ^^^ ([\^]{3}) можно будет заменить на \n).
        # positive lookbehind + пробел + positive lookahead
        # r'(?<=[;])\s(?=[2-9]{0})'.format(closing_parenthesis_or_dot_group): '^^^'
        r'(?<=[;])\s(?=[2-9])': '^^^',

        r'пасс,': 'пасс.',

        # откорректировать не всегда чётко распознанное указание на конъюнктив
        r'кон[ьъ][.,](?=\sаор)': 'конъ.',

        r'повел, ': 'повел. ',
        r'повел,(?=аор)': 'повел.',

        r'\(букв,': '(букв.',
        r'аормасс[.]': 'аор.пасс.',

    }

    result = input_text
    for k, v in find_and_replace_dict.items():
        result = re.sub(k, v, result)

    # Перевод последнего по списку греческого слова может заканчиваться на др. греч. слово (свою нач. форму) и в этом случае
    # возникает лишний pipe в конце, из-за которого конвертированный в табличную форму текст будет содержать доп. столбец
    # Поэтому такой pipe в самом конце текста нужно стрипать!
    # ζώσω |буд. к ζώννυμι |
    result = result.strip('|')

    return result


#############

# text = """
# αισχρότης, ητος ж.р. непристойное (неподобающее) поведение αίσχύνη, ης ж.р. 1) стыд, срам, позор; бесстыдство; 2) постыдные дела (Иуд 13) αισχύνομαι стыдиться; быть пристыженным αιτέω 1) просить; 2) требовать, добиваться; 3) молиться αίτημα, τος ср.р. 1) просьба; требование; 2) просимое, то, о чем просят
# """

text = """
тот ,     который
άμάω косить; жать; убирать урожай
άκρογωνιαΐος, α, ον краеугольный или замковый (о камне)
άλίζω (буд.пасс. άλισθήσομαι) солить; возвращать вкус соли
προσεκύνησεν έπι το άκρον τής ράβδου αύτοϋ он поклонился, опершись на жезл (Евр 11.21)
άλλάσσω (буд.пасс. άλλαγήσο-μαι) 1) менять, изменять; 2) заменять (Рим 1.23)
Άκύλας (вин.п.) м.р. Акила, Ак-вила
άνηρέθην аор.пасс. к άναιρέω άνήφθην аор.пасс. к άνάπτω άνήχθην аор.пасс. к άνάγω άνθέξομαι буд. к άντέχομαι
1. прил. угождающий людям; 2. м.р. льстец, подхалим
"""

# text = """
# 1. прил. угождающий людям; 2. м.р. льстец, подхалим
# пасс, иногда заслуживать;
# """
#
# text = """
# конь. аор.
# конъ, аор.
# конъ. аор.
# """
#
# text = "сбиться с пути, уклониться (букв, промахнуться)"

# text = """
# άνηρέθην аор.пасс. к άναιρέω άνήφθην аор.пасс. к άνάπτω άνήχθην аор.пасс. к άνάγω άνθέξομαι буд. к άντέχομαι
# """

text = """
άλίζω (буд.пасс. άλισθήσομαι) солить; возвращать вкус соли
βλητέος, α, ον (отглагольное прил. к βάλλω) то, что должно быть положено или налито
"""

text = 'повел, аор.'
text = 'εδραμον αορ. к τρέχω'
text = 'аормасс.к'
text = 'аормасс.к'
text = 'обрушиваться (о бедах)] 3) случаться, происходить (Деян 13.40);'

# res = run(text)
# print(res)
