from A30_SquareBracketsContentsFormatter import A30_SquareBracketsContentsFormatter


# Существует группа слов, которые встречаются в тексте и в квадратных скобках, и без них, и в зависимости от этого они
# должны по-разному должны форматироваться:
# - [амер.] - форматируется только зелёным цветом (вместе с квадратными скобками)
# - амер. - форматируется и зелёным цветом, и курсивом
# В таких случаях нужно сначала форматировать ту последовательность, которая длиннее, а затем ту, которая короче.

# Перед тем, как форматировать спец. термины одновременно зелёным и курсивом, нужно отформатировать зелёным цветом
# некоторые слова в квадратных скобках (вместе со скобками) вида [амер.] (полный список таких слов в классе
# A30_SquareBracketsContentsFormatter).
# Это нужно сделать в самую первую очередь, чтобы квадратные скобки не отделялись форматирующей html-разметкой от
# самого слова, т. е. [амер.] не должно превратиться в:
# 'Это пример текста: [<span style="color: rgb(0, 170, 0);"><i>амер.</i></span>] и другие слова.'
# Должно это выглядеть на данном этапе так:
# 'Это пример текста: <span style="color: rgb(0, 170, 0);">[амер.]</span> и другие слова.'
# (т. е. квадратные скобки продолжают окаймлять слово "амер." и не отделяются разметкой от него).
# Затем A20_GreenAndItalicFormatter обернёт слово "амер." в курсив, который я потом в классе C40_... удалю, т. к.
# такие спец. термины в квадратных скобках я форматирую без курсива.
class A11_GreenOnlyFormatter:

    def __init__(self):
        self.a30_squareBracketsContentsFormatter = A30_SquareBracketsContentsFormatter()

    def format_green_only(self, html_str):
        result = html_str
        result = self.a30_squareBracketsContentsFormatter.make_green(result)
        return result


##########################

a11_GreenOnlyFormatter = A11_GreenOnlyFormatter()

html_str = 'сокращение [амер.] означает "американский"'

# res = a11_GreenOnlyFormatter.format_green_only(html_str)
# print(res)
